---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltAssembly
source: html/47a3f5b2-17f0-7edb-60e6-198ea99774e5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltAssembly Property

"Assembly"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltAssembly { get; }
```